{
  "22003": "O valor fornecido para o campo '%s' é inválido. Verifique os dados informados e certifique-se de inserir um valor que esteja de acordo com o formato e restrições do campo específico. Em alguns casos, pode ser necessário fornecer um valor numérico quando o campo espera um número, ou uma data válida quando o campo espera uma data. Verifique também se não há caracteres especiais, espaços em branco ou valores ausentes que possam causar o erro. Corrija o valor informado e tente novamente.",
  "22P02": "O valor '%s' não é válido para este tipo de dado. Certifique-se de que o valor esteja no formato correto e seja compatível com o tipo de dado esperado. Por exemplo, se o campo espera um número inteiro, certifique-se de fornecer um valor numérico inteiro sem decimais. Se o campo espera uma string, verifique se o valor está entre aspas ou aspas simples, de acordo com a convenção utilizada. Verifique também se não há caracteres inválidos ou incompatíveis com o tipo de dado esperado. Corrija o valor informado e tente novamente.",
  "23502": "A coluna '%s' não pode ser deixada em branco. Certifique-se de preencher todos os campos obrigatórios antes de prosseguir. Verifique se não há campos que foram deixados vazios ou com valores nulos, pois isso pode causar o erro. Se necessário, forneça valores válidos para todas as colunas obrigatórias e tente novamente.",
  "23503": "Não foi possível encontrar a chave estrangeira na tabela '%s'. Verifique os dados relacionados e certifique-se de que as referências estejam corretas. Esse erro ocorre quando uma chave estrangeira é utilizada para fazer referência a um registro em outra tabela, mas o registro correspondente não existe. Verifique se os dados relacionados estão corretos e se os registros referenciados existem na tabela relacionada. Corrija as referências e tente novamente.",
  "23505": "Violação de restrição de chave única na tabela '%s'. Isso ocorre quando há uma tentativa de inserir ou atualizar um registro que viola a restrição de chave única. Certifique-se de que os valores fornecidos para os campos correspondentes não estejam duplicados e sejam únicos. Verifique se já não existe um registro com os mesmos valores únicos na tabela. Se necessário, altere os valores dos campos para que sejam distintos e tente novamente.",
  "23514": "Não foi possível encontrar a chave estrangeira na tabela '%s'. Verifique os dados relacionados e certifique-se de que as referências estejam corretas. Esse erro ocorre quando uma chave estrangeira é utilizada para fazer referência a um registro em outra tabela, mas o registro correspondente não existe. Verifique se os dados relacionados estão corretos e se os registros referenciados existem na tabela relacionada. Corrija as referências e tente novamente.",
  "55P03": "Já existe um bloqueio em andamento para o objeto solicitado. Aguarde um momento e tente novamente mais tarde.",
  "42P01": "A tabela '%s' não existe. Verifique o nome da tabela e certifique-se de fornecer o nome correto. Verifique também se a tabela foi criada corretamente e se está disponível no banco de dados.",
  "42P02": "A coluna '%s' não existe na tabela '%s'. Verifique o nome da coluna e certifique-se de fornecer o nome correto. Verifique também se a coluna foi criada corretamente e se está disponível na tabela especificada.",
  "42703": "A coluna '%s' não foi encontrada na tabela. Verifique o nome da coluna e certifique-se de fornecer o nome correto. Verifique também se a coluna existe na tabela especificada e se está disponível.",
  "42702": "A coluna '%s' especificada não existe na instrução SELECT. Verifique o nome da coluna e certifique-se de fornecer o nome correto. Verifique também se a coluna está presente nas tabelas utilizadas na instrução SELECT e se está disponível."
}